app/views/v2/qbe/getZipCode.xml.erb

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:proc="<%= Rails.application.credentials.qbe[:uri][Rails.application.credentials.rails_env.to_sym] %>">
	<soapenv:Header/>
	<soapenv:Body>
		<proc:processRenterRequest>
			<xmldata>
        <![CDATA[
        <?xml version="1.0" encoding="UTF-8"?>
        <zipcode_find version="<%= request[:version] %>">
        	<heading>
        		<program name="<%= request[:heading][:program][:name] %>" requesttimestamp="<%= request[:heading][:program][:requesttimestamp] %>" ClientName="<%= request[:heading][:program][:ClientName] %>"/>
        	</heading>
        	<request type="<%= request[:data][:type] %>">
        		<senderID><%= request[:data][:senderID] %></senderID>
        		<receiverID><%= request[:data][:receiverID] %></receiverID>
        		<prop_zipcode><%= request[:data][:prop_zipcode] %></prop_zipcode>
        	</request>
        </zipcode_find>          
        ]]>
			</xmldata>
		</proc:processRenterRequest>
	</soapenv:Body>
</soapenv:Envelope>